Revit 2027 API
ScheduleFilter.GetDoubleValue Method
 Gets the filter value for a filter using a double value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDoubleValue()
Public Function GetDoubleValue As Double
public:
double GetDoubleValue()
member GetDoubleValue : unit -> float
Return Value
Double
 The filter value.
Exceptions
Exception | Condition
InvalidOperationException |  The filter value is not a double.
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace